# Pandas

- Pandas is a Python librray that is to manipulate the data as we do in MS Excel.
- Pandas stands for Panel Data.

# How to import pandas

In [1]:
import pandas as pd

# Version

In [2]:
pd.__version__

'1.4.4'

# In Pandas we work upon two objects-
- 1- Series
- 2- Dataframe

# 1- Series

- A series is like a 1-D array structure.
- A series can be considered as a column from an excel table.
- A column without a header is a Series.

# How to create a Seires

In [3]:
# pd.Series()

# Creating a Series using a list or tuple.

In [5]:
lst=[10,20,30,40,50,60,70,80,90]
s=pd.Series(lst)

In [6]:
s

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

**A series contains two objects**
- The first object is the index object.
- The second object is the values.

In [7]:
names=['Aravind','Shweta','Suraj','Rajesh','Priya','Vaishali']
emp=pd.Series(names)
emp

0     Aravind
1      Shweta
2       Suraj
3      Rajesh
4       Priya
5    Vaishali
dtype: object

In [8]:
names=('Aravind','Shweta','Suraj','Rajesh','Priya','Vaishali')
emp=pd.Series(names)
emp

0     Aravind
1      Shweta
2       Suraj
3      Rajesh
4       Priya
5    Vaishali
dtype: object

# Attributes on a Series

### size
- It returns the number of elements from a Series

In [9]:
emp.size

6

In [10]:
len(emp)

6

### dtype
- It returns the data type of the values that the Series contains.

In [12]:
s.dtype

dtype('int64')

In [13]:
emp.dtype

dtype('O')

### ndim
- It returns the dimension of the Series.

In [14]:
s.ndim

1

In [15]:
emp.ndim

1

### shape
- It returns the shape.

In [16]:
s.shape

(9,)

In [17]:
emp.shape

(6,)

### index
- It returns the index object that contains the indices of the series.

In [18]:
s.index

RangeIndex(start=0, stop=9, step=1)

In [19]:
emp.index

RangeIndex(start=0, stop=6, step=1)

### values
- It returns an array that contains the values from the series.

In [21]:
s.values

array([10, 20, 30, 40, 50, 60, 70, 80, 90], dtype=int64)

In [23]:
emp.values

array(['Aravind', 'Shweta', 'Suraj', 'Rajesh', 'Priya', 'Vaishali'],
      dtype=object)

### name

- It is used to name a Series.

In [27]:
s

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

In [28]:
s.name='Numbers'

In [29]:
s

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
Name: Numbers, dtype: int64

In [30]:
s.name

'Numbers'

# Creating a Series using dictionary

- When we create a series using a dictionary then the keys from the dictionary become the index and the values from the dictionary become the values.

In [24]:
info={'ID':101,'Name':'Suresh','Age':31,'Company':'TCS'}
info

{'ID': 101, 'Name': 'Suresh', 'Age': 31, 'Company': 'TCS'}

In [25]:
info_ser=pd.Series(info)
info_ser

ID            101
Name       Suresh
Age            31
Company       TCS
dtype: object

In [26]:
info_ser.index

Index(['ID', 'Name', 'Age', 'Company'], dtype='object')

# Indexes of a Series

- 1- Implicit indexes (Pandas Defined) 0 to len(ser)-1
- 2- Explicit indexes (User Defined). These are also called as labels.

In [32]:
names

('Aravind', 'Shweta', 'Suraj', 'Rajesh', 'Priya', 'Vaishali')

In [34]:
s=pd.Series(names)
s

0     Aravind
1      Shweta
2       Suraj
3      Rajesh
4       Priya
5    Vaishali
dtype: object

In [35]:
s.index

RangeIndex(start=0, stop=6, step=1)

In [36]:
info_ser

ID            101
Name       Suresh
Age            31
Company       TCS
dtype: object

In [41]:
info_ser.index

Index(['ID', 'Name', 'Age', 'Company'], dtype='object')

# How to pass user defined indexes (labels)

In [39]:
names

('Aravind', 'Shweta', 'Suraj', 'Rajesh', 'Priya', 'Vaishali')

In [50]:
s=pd.Series(names,index=list('abcdef'))
s

a     Aravind
b      Shweta
c       Suraj
d      Rajesh
e       Priya
f    Vaishali
dtype: object

In [47]:
s.index

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [44]:
list('abcdef')

['a', 'b', 'c', 'd', 'e', 'f']

In [53]:
import numpy as np

In [58]:
ser=pd.Series(np.array([1000,2000,3000,4000,5000]))
ser

0    1000
1    2000
2    3000
3    4000
4    5000
dtype: int32

In [60]:
ser.index=['num_1','num_2','num_3','num_4','num_5']

In [61]:
ser

num_1    1000
num_2    2000
num_3    3000
num_4    4000
num_5    5000
dtype: int32

In [62]:
countries=['India','Russia','Vietnam','China','U.K.','Japan','Indonesia']
capitals=['Delhi','Moscow','Hanoi','Beijing','London','Tokyo','Jakarta']

In [63]:
# Countries- indexes
# capitals=values

In [66]:
cc=pd.Series(capitals,index=countries)
cc

India          Delhi
Russia        Moscow
Vietnam        Hanoi
China        Beijing
U.K.          London
Japan          Tokyo
Indonesia    Jakarta
dtype: object

# How to access an elements from a Series

In [68]:
s=pd.Series(names)
s

0     Aravind
1      Shweta
2       Suraj
3      Rajesh
4       Priya
5    Vaishali
dtype: object

In [69]:
# s[index]

In [78]:
# s[5]

# iloc and loc

- iloc- It stands from index location.
- iloc is used to fetch a value on the basis of implicit indexes.
- loc- It stands from location.
- los is used to fetch a value on the basis of explicit indexes (labels).

In [79]:
s

0     Aravind
1      Shweta
2       Suraj
3      Rajesh
4       Priya
5    Vaishali
dtype: object

In [83]:
s.iloc[1]

'Shweta'

In [84]:
cc

India          Delhi
Russia        Moscow
Vietnam        Hanoi
China        Beijing
U.K.          London
Japan          Tokyo
Indonesia    Jakarta
dtype: object

In [87]:
cc.loc['Japan']

'Tokyo'

In [91]:
cc.iloc[2]

'Hanoi'

# Slicing

In [92]:
# s.iloc[start:stop:step] (implicit indexes)
# s.loc[start:stop:step] (labels). Stop is included.

In [102]:
cc

India          Delhi
Russia        Moscow
Vietnam        Hanoi
China        Beijing
U.K.          London
Japan          Tokyo
Indonesia    Jakarta
dtype: object

In [103]:
cc.iloc[::-1]

Indonesia    Jakarta
Japan          Tokyo
U.K.          London
China        Beijing
Vietnam        Hanoi
Russia        Moscow
India          Delhi
dtype: object

In [105]:
# cc.loc[0:2]

In [108]:
cc.loc['India':'China']

India        Delhi
Russia      Moscow
Vietnam      Hanoi
China      Beijing
dtype: object

In [109]:
cc.loc['India':'China':2]

India      Delhi
Vietnam    Hanoi
dtype: object

In [113]:
cc.loc['Indonesia':'India':-1]

Indonesia    Jakarta
Japan          Tokyo
U.K.          London
China        Beijing
Vietnam        Hanoi
Russia        Moscow
India          Delhi
dtype: object

In [114]:
cc

India          Delhi
Russia        Moscow
Vietnam        Hanoi
China        Beijing
U.K.          London
Japan          Tokyo
Indonesia    Jakarta
dtype: object

In [115]:
# Fetch Beijing

In [116]:
cc.iloc[3]

'Beijing'

In [117]:
cc.loc['China']

'Beijing'

In [118]:
cc.iloc[-4]

'Beijing'

In [120]:
# Fetch Jakarta

cc.iloc[-1]

'Jakarta'

In [121]:
cc.iloc[6]

'Jakarta'

In [124]:
cc.iloc[len(cc)-1]

'Jakarta'

In [125]:
cc.loc['Indonesia']

'Jakarta'

# Operations on a Series

In [126]:
arr=np.random.randint(10,100,12)

In [128]:
num=pd.Series(arr)
num

0     63
1     59
2     19
3     69
4     43
5     40
6     95
7     94
8     96
9     44
10    10
11    85
dtype: int32

In [129]:
num.sum()

717

In [130]:
num.mean()

59.75

In [131]:
num.median()

61.0

In [132]:
num.var()

865.2954545454545

In [133]:
num.std()

29.415904788829028

In [134]:
num.max()

96

In [135]:
num.min()

10

# Sorting a series

In [136]:
# ser.sort_values()

In [137]:
num

0     63
1     59
2     19
3     69
4     43
5     40
6     95
7     94
8     96
9     44
10    10
11    85
dtype: int32

In [140]:
num.sort_values(ignore_index=True)

0     10
1     19
2     40
3     43
4     44
5     59
6     63
7     69
8     85
9     94
10    95
11    96
dtype: int32

In [139]:
num

0     63
1     59
2     19
3     69
4     43
5     40
6     95
7     94
8     96
9     44
10    10
11    85
dtype: int32

In [141]:
num

0     63
1     59
2     19
3     69
4     43
5     40
6     95
7     94
8     96
9     44
10    10
11    85
dtype: int32

In [146]:
num.sort_values(ascending=False,ignore_index=True)

0     96
1     95
2     94
3     85
4     69
5     63
6     59
7     44
8     43
9     40
10    19
11    10
dtype: int32

# 2- Dataframe

- It is like a 2-D array structure.
- It can be considered as an excel table.
- It is the collection of rows and columns.

# How to create a dataframe

In [147]:
# pd.DataFrame()

# Using a 2-D list

In [150]:
names=['Aravind','Shweta','Suraj','Rajesh','Priya','Vaishali']
ID=[101,102,103,104,105,106]
city=['Delhi','Agra','Chandigarh','Pune','Hyderabd','Bangalore']

In [158]:
lst=[names,ID,city]
lst

[['Aravind', 'Shweta', 'Suraj', 'Rajesh', 'Priya', 'Vaishali'],
 [101, 102, 103, 104, 105, 106],
 ['Delhi', 'Agra', 'Chandigarh', 'Pune', 'Hyderabd', 'Bangalore']]

In [159]:
df=pd.DataFrame(lst)
df

         0       1           2       3         4          5
0  Aravind  Shweta       Suraj  Rajesh     Priya   Vaishali
1      101     102         103     104       105        106
2    Delhi    Agra  Chandigarh    Pune  Hyderabd  Bangalore

In [160]:
df=pd.DataFrame(lst).T
df

          0    1           2
0   Aravind  101       Delhi
1    Shweta  102        Agra
2     Suraj  103  Chandigarh
3    Rajesh  104        Pune
4     Priya  105    Hyderabd
5  Vaishali  106   Bangalore

In [162]:
df.columns=['Name','ID','City']

In [163]:
df

       Name   ID        City
0   Aravind  101       Delhi
1    Shweta  102        Agra
2     Suraj  103  Chandigarh
3    Rajesh  104        Pune
4     Priya  105    Hyderabd
5  Vaishali  106   Bangalore

In [165]:
lst=[['Aravind',101,'Delhi'],['Shweta',102,'Agra'],['Suraj',103,'Chandigarh'],['Rajesh',104,'Pune'],['Priya',105,'Hyderabad'],['Vaishali',106,'Bangalore']]
lst

[['Aravind', 101, 'Delhi'],
 ['Shweta', 102, 'Agra'],
 ['Suraj', 103, 'Chandigarh'],
 ['Rajesh', 104, 'Pune'],
 ['Priya', 105, 'Hyderabad'],
 ['Vaishali', 106, 'Bangalore']]

In [167]:
pd.DataFrame(lst,columns=['Name','ID','City'])

       Name   ID        City
0   Aravind  101       Delhi
1    Shweta  102        Agra
2     Suraj  103  Chandigarh
3    Rajesh  104        Pune
4     Priya  105   Hyderabad
5  Vaishali  106   Bangalore

# Creating a dataframe using a dictionary

- When we create a dataframe using a dictionary then keys of the dictionary become the column names in the dataframe.

In [174]:
emp={'Name':['Rajesh','Shubham','Pragya','Surendra','Aniket','Shweta'],
    'ID':[101,102,103,104,105,106],
    'City':['Pune','Chennai','Mumbai','Bangalore','Hyderabad','Noida']}

In [175]:
emp

{'Name': ['Rajesh', 'Shubham', 'Pragya', 'Surendra', 'Aniket', 'Shweta'],
 'ID': [101, 102, 103, 104, 105, 106],
 'City': ['Pune', 'Chennai', 'Mumbai', 'Bangalore', 'Hyderabad', 'Noida']}

In [176]:
pd.DataFrame(emp)

       Name   ID       City
0    Rajesh  101       Pune
1   Shubham  102    Chennai
2    Pragya  103     Mumbai
3  Surendra  104  Bangalore
4    Aniket  105  Hyderabad
5    Shweta  106      Noida

# Creating a Dataframe using series

In [178]:
ns=pd.Series(['Rajesh','Shubham','Pragya','Surendra','Aniket','Shweta'])
ids=pd.Series([101,102,103,104,105,106])

In [179]:
ns

0      Rajesh
1     Shubham
2      Pragya
3    Surendra
4      Aniket
5      Shweta
dtype: object

In [180]:
ids

0    101
1    102
2    103
3    104
4    105
5    106
dtype: int64

In [183]:
pd.DataFrame([ns,ids]).T

          0    1
0    Rajesh  101
1   Shubham  102
2    Pragya  103
3  Surendra  104
4    Aniket  105
5    Shweta  106

In [185]:
ns.name='Emp_Name'

In [186]:
ns

0      Rajesh
1     Shubham
2      Pragya
3    Surendra
4      Aniket
5      Shweta
Name: Emp_Name, dtype: object

In [188]:
ids.name='Code'

In [189]:
ids

0    101
1    102
2    103
3    104
4    105
5    106
Name: Code, dtype: int64

In [193]:
pd.DataFrame([ns,ids])

               0        1       2         3       4       5
Emp_Name  Rajesh  Shubham  Pragya  Surendra  Aniket  Shweta
Code         101      102     103       104     105     106

In [192]:
emp_data=pd.DataFrame([ns,ids]).T
emp_data

   Emp_Name Code
0    Rajesh  101
1   Shubham  102
2    Pragya  103
3  Surendra  104
4    Aniket  105
5    Shweta  106

In [194]:
pd.DataFrame(ns)

   Emp_Name
0    Rajesh
1   Shubham
2    Pragya
3  Surendra
4    Aniket
5    Shweta

In [195]:
# [ser_1,ser_2,ser_3,ser_4]

In [196]:
ns

0      Rajesh
1     Shubham
2      Pragya
3    Surendra
4      Aniket
5      Shweta
Name: Emp_Name, dtype: object

In [203]:
pd.DataFrame([ns,ids]).T

   Emp_Name Code
0    Rajesh  101
1   Shubham  102
2    Pragya  103
3  Surendra  104
4    Aniket  105
5    Shweta  106

In [204]:
s

0     Aravind
1      Shweta
2       Suraj
3      Rajesh
4       Priya
5    Vaishali
dtype: object

In [206]:
s2=pd.Series([100,200,300,400,500,600])
s2

0    100
1    200
2    300
3    400
4    500
5    600
dtype: int64

In [209]:
sdf=pd.DataFrame([s,s2]).T
sdf

          0    1
0   Aravind  100
1    Shweta  200
2     Suraj  300
3    Rajesh  400
4     Priya  500
5  Vaishali  600

In [210]:
sdf.columns=['Name','Code']

In [211]:
sdf

       Name Code
0   Aravind  100
1    Shweta  200
2     Suraj  300
3    Rajesh  400
4     Priya  500
5  Vaishali  600

In [212]:
s

0     Aravind
1      Shweta
2       Suraj
3      Rajesh
4       Priya
5    Vaishali
dtype: object

In [213]:
s.name='Student_Name'

In [214]:
s

0     Aravind
1      Shweta
2       Suraj
3      Rajesh
4       Priya
5    Vaishali
Name: Student_Name, dtype: object

In [215]:
s2

0    100
1    200
2    300
3    400
4    500
5    600
dtype: int64

In [216]:
s2.name='Roll_No'

In [217]:
s2

0    100
1    200
2    300
3    400
4    500
5    600
Name: Roll_No, dtype: int64

In [219]:
pd.DataFrame([s,s2]).T

  Student_Name Roll_No
0      Aravind     100
1       Shweta     200
2        Suraj     300
3       Rajesh     400
4        Priya     500
5     Vaishali     600

In [221]:
d=pd.DataFrame(ns)
d

   Emp_Name
0    Rajesh
1   Shubham
2    Pragya
3  Surendra
4    Aniket
5    Shweta

In [222]:
ns

0      Rajesh
1     Shubham
2      Pragya
3    Surendra
4      Aniket
5      Shweta
Name: Emp_Name, dtype: object

In [223]:
type(d)

pandas.core.frame.DataFrame

In [224]:
type(ns)

pandas.core.series.Series

In [225]:
# 6 classes